In [5]:
##DELIVERABLE 1
#Import dependances and needed files


import pandas as pd
import numpy as np
import os

#create path to file
full_student_data=os.path.join('Resources','new_full_student_data.csv')
student_df=pd.read_csv(full_student_data)


#confirm that file was imported correctly
student_df.head()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,103880842,Travis Martin,9th,Sullivan High School,59.0,88.2,Public,961125
1,45069750,Michael Brown,9th,Dixon High School,94.7,73.5,Charter,870334
2,45024902,Gabriela Lucero,9th,Wagner High School,89.0,70.4,Public,846745
3,62582498,Susan Richardson,9th,Silva High School,69.7,80.3,Public,991918
4,16437227,Sherry Davis,11th,Bowers High School,NaN,27.5,Public,848324

In [6]:
student_df.tail()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
19509,109236636,Robert Sawyer,12th,Silva High School,43.3,27.2,Public,991918
19510,63239258,David Herman,9th,Woods High School,52.1,80.4,Public,912243
19511,95516554,Megan Gill,11th,Wagner High School,93.9,84.1,Public,846745
19512,65050383,Lori Stone,11th,Bowers High School,94.6,70.9,Public,848324
19513,34720657,Anna Jensen,12th,Montgomery High School,82.3,42.4,Charter,893368

In [12]:
##DELIVERABLE 2
#Check for null values
student_df.isna().sum()

student_id          0
student_name        0
grade               0
school_name         0
reading_score    1968
math_score        982
school_type         0
school_budget       0
dtype: int64

In [17]:
#drop rows with null values and verify removal
import pandas as pd
import numpy as np

student_df=students_df.dropna()
student_df.isna().sum()

student_id       0
student_name     0
grade            0
school_name      0
reading_score    0
math_score       0
school_type      0
school_budget    0
dtype: int64

In [16]:
#check for duplicate rows
student_df.duplicated().sum()

2168

In [18]:
student_df= student_df.drop_duplicates()
student_df
student_df.duplicated().sum()

0

In [19]:
#check data types
student_df.dtypes

student_id         int64
student_name      object
grade             object
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [20]:
#examine the grade column to understand why is not an int
student_df['grade']

0         9th
1         9th
2         9th
3         9th
5         9th
         ...
19508    10th
19509    12th
19511    11th
19512    11th
19513    12th
Name: grade, Length: 14831, dtype: object

In [21]:
#remove the suffix from the grade value
student_df['grade']=students_df['grade'].str.replace('th','')
student_df['grade']

0         9
1         9
2         9
3         9
5         9
         ..
19508    10
19509    12
19511    11
19512    11
19513    12
Name: grade, Length: 14831, dtype: object

In [23]:
#change the column to the int type and verify the column types
student_df['grade']=student_df['grade'].astype(int)
student_df.dtypes

student_id         int64
student_name      object
grade              int32
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [24]:
##Deliverable3
#display summery statistics for the dataframe
student_df.describe()

         student_id         grade  reading_score    math_score  school_budget
count  1.483100e+04  14831.000000   14831.000000  14831.000000   14831.000000
mean   6.975296e+07     10.355539      72.357865     64.675733  893742.749107
std    3.452909e+07      1.097728      15.224590     15.844093   53938.066467
min    1.000906e+07      9.000000      10.500000      3.700000  817615.000000
25%    3.984433e+07      9.000000      62.200000     54.500000  846745.000000
50%    6.965978e+07     10.000000      73.800000     65.300000  893368.000000
75%    9.927449e+07     11.000000      84.000000     76.000000  956438.000000
max    1.299997e+08     12.000000     100.000000    100.000000  991918.000000

In [25]:
#display the mean math score
student_df['math_score'].mean()

64.67573326141189

In [26]:
#store the minum reading score as min_reading_score

min_reading_score=student_df['reading_score'].min()

In [109]:
##deliverable4

#use the loc to display the grade column

students_df.loc[:, ["grade"]]

       grade
0          9
1          9
2          9
3          9
4         11
...      ...
19508     10
19509     12
19511     11
19512     11
19513     12

[17346 rows x 1 columns]

In [27]:
#use iloc to display te first 3 rows and column 3,4,and 5

student_df.iloc[0:3,[3,4,5]]

            school_name  reading_score  math_score
0  Sullivan High School           59.0        88.2
1     Dixon High School           94.7        73.5
2    Wagner High School           89.0        70.4

In [35]:
#select the rows for grade nine and display their summary statistiscs using loc

grade_nine_students=student_df.loc[students_df["grade"] == "9th"]
grade_nine_students.describe()

         student_id   grade  reading_score   math_score  school_budget
count  4.132000e+03  4132.0    4132.000000  4132.000000    4132.000000
mean   6.979441e+07     9.0      69.236713    66.585624  898692.606002
std    3.470565e+07     0.0      15.277354    16.661533   54891.596611
min    1.000906e+07     9.0      17.900000     5.300000  817615.000000
25%    3.953848e+07     9.0      59.000000    56.000000  846745.000000
50%    6.984037e+07     9.0      70.050000    67.800000  893368.000000
75%    9.939504e+07     9.0      80.500000    78.500000  957299.000000
max    1.299997e+08     9.0      99.900000   100.000000  991918.000000

In [36]:
# Store the row with the minimum overall reading score as `min_reading_row`
# using `loc` and the `min_reading_score` found in Deliverable 3.

min_reading_score=students_df["reading_score"].min()
min_reading_row = students_df.loc[students_df["reading_score"] == min_reading_score]
min_reading_row

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
3706,81758630,Matthew Thomas,10th,Dixon High School,10.5,58.4,Charter,870334

In [39]:
# Use loc with conditionals to select all reading scores from 10th graders at Dixon High School.



student_df.loc[(student_df["school_name"]== "Dixon High School") &
            (student_df["grade"] ==10),"reading_score"]

45       71.1
60       59.5
69       88.6
94       81.5
100      95.3
         ...
19283    52.9
19306    58.0
19344    38.0
19368    84.4
19445    43.9
Name: reading_score, Length: 569, dtype: float64

In [64]:
# Find the mean reading score for all students in grades 11 and 12 combined.
avg_student_scores_by_grade = student_df.loc[(student_df['grade']==11)|(student_df['grade']==12),"reading_score"].mean()

avg_student_scores_by_grade

74.90038089192188

In [61]:
#Display the average budget for each school type by using the groupby and mean functions
school_type_df=students_df.groupby(["school_type"])
school_type_df['school_budget'].mean()

school_type
Charter    872636.854504
Public     911205.058545
Name: school_budget, dtype: float64

In [72]:
# Use the `groupby`, `count`, and `sort_values` functions to find the
# total number of students at each school and sort from most students to least students.

new_student_count=student_df[["school_name", "student_id"]].groupby(by="school_name",as_index=True).count()
new_student_count
new_student_count.rename(columns={"student_id":"count"}).sort_values("count",ascending=False)

                        count
school_name
Montgomery High School   2038
Green High School        1961
Dixon High School        1583
Wagner High School       1541
Silva High School        1109
Woods High School        1052
Sullivan High School      971
Turner High School        846
Bowers High School        803
Fisher High School        798
Richard High School       551
Campos High School        541
Odonnell High School      459
Campbell High School      407
Chang High School         171

In [43]:
#use groupby to find average math score by grade and for each school type
avg_by_school = student_df.groupby(['school_type', 'grade']).mean()
avg_by_school.loc[:, ["math_score"]]

                   math_score
school_type grade
Charter     9       70.077874
            10      66.443206
            11      68.024735
            12      60.212121
Public      9       63.771066
            10      63.764121
            11      59.314337
            12      63.568319

In [ ]:
## Deliverable 6 -Written Analysis
#The Schooll District data used to do my analysis contained data about math scores
#reading scores and the school budgets for all the grades in different schools.
#The analysis showed that 9th graders scored above that average total math score.
# Additional findings include that public schools had a larger budget than private schools.
#Grades 9,10,11 in charter schools scored better in math ,however 12 grade students in public
#schools scored better than charter schoools.